Repository: pypi-data/pypi-mirror-246
Catalog: packages/pyams-auth-ldap/pyams_auth_ldap-2.0.1-py3-none-any.whl/pyams_auth_ldap/locales/*/LC_MESSAGES/pyams_auth_ldap.po
Languages: fr

source: Base object
fr: Objet de base

source: Single level
fr: Un seul niveau

source: Whole subtree
fr: Sous-arbre complet

source: Use group attribute to get members list
fr: Un attribut du groupe contient la liste de ses membres

source: Use member attribute to get groups list
fr: Un attribut de l'utilisateur contient la liste de ses groupes

source: none (only use members own mail address)
fr: aucun (n'utiliser que l'adresse des membres)

source: Use group internal attribute
fr: interne : utiliser un attribut interne du groupe

source: Use another group internal attribute
fr: redirection : utiliser un attribut d'un autre groupe

source: LDAP directory plug-in
fr: Annuaire LDAP

source: LDAP server URI
fr: URI du serveur LDAP

source: Full URI (including protocol) of LDAP server
fr: URI complète (y compris le protocole et le numéro de port) du serveur LDAP

source: Start TLS
fr: Utiliser StartTLS

source: Should we start an encrypted connection using StartTLS?
fr: Utiliser la commande StartTLS pour démarrer une communication cryptée à partir d'une connexion non sécurisée

source: Bind DN
fr: DN de connexion

source: DN used for LDAP bind; keep empty for anonymous
fr: DN utilisé pour la connexion LDAP ; à laisser vide pour une connexion anonyme

source: Bind password
fr: Mot de passe de connexion

source: Password used for LDAP bind
fr: Mot de passe utilisé pour la connexion LDAP ; à laisser vide pour une connexion anonyme

source: Bind mode
fr: Mode d'authentification'

source: Authentication mode used for binding
fr: Mode utilisé lors de la phase d'authentification

source: Base DN
fr: DN de base

source: LDAP base DN
fr: DN de base utilisé pour la recherche des utilisateurs

source: Search scope
fr: Portée de la recherche

source: Login attribute
fr: Attribut de connexion

source: LDAP attribute used as user login
fr: Attribut LDAP utilisé pour la connexion d'un utilisateur

source: Login query
fr: Requête de connexion

source: Query template used to authenticate user (you can replace login attribute with '{login}')
fr: Modèle de la requête LDAP utilisée pour authentifier un utilisateur ; vous pouvez remplacer le login de l'utilisateur par '{login}'

source: UID attribute
fr: Identifiant utilisateur

source: LDAP attribute used as principal identifier
fr: Attribut LDAP utilisé pour l'identification d'un utilisateur

source: UID query
fr: Recherche d'utilisateur

source: Query template used to get principal information (you can replace UID attribute with '{login}')
fr: Modèle de la requête LDAP utilisée pour rechercher un utilisateur à partir de son identifiant vous pouvez remplacer cet identifiant par '{login}' dans le modèle de requête

source: Title format
fr: Format d'affichage

source: Principal's title format string
fr: Modèle de la chaîne de formatage utilisée pour l'affichage du nom d'un utilisateur ; vous pouvez indiquer le nom de tous les attributs LDAP entre accolades

source: Mail attribute
fr: Adresse de messagerie

source: LDAP attribute storing mail address
fr: Nom de l'attribut LDAP contenant l'adresse de messagerie

source: Extra attributes
fr: Autres attributs

source: Comma separated list of additional attributes which will be extracted by principals
fr: Vous pouvez indiquer, en les séparant par des virgules, une liste d'attributs spécifiques qui seront extraits pour compléter les informations sur les utilisateurs lors de leur recherche

source: Groups base DN
fr: DN de base des groupes

source: Base DN used to search LDAP groups; keep empty to disable groups usage
fr: DN de base utilisé pour la recherche des groupes ; laissez ce champ vide pour désactiver cette recherche

source: Groups search scope
fr: Portée de la recherche

source: Group prefix
fr: Préfixe des groupes

source: Prefix used to identify groups as principals
fr: Préfixe utilisé pour identifier les groupes en tant que mandataires

source: Group UID attribute
fr: Identifiant de groupe

source: LDAP attribute used as group identifier
fr: Nom de l'attribut LDAP utilisé pour identifier les groupes

source: Group title format
fr: Format d'affichage

source: Members query mode
fr: Recherche des membres

source: Define how groups members are defined
fr: Mode utilisé pour la recherche des membres d'un groupe

source: Groups query
fr: Recherche des groupes

source: When members are stored inside a group attribute, this query template is used to get principal groups (based on DN and UID attributes called '{dn}' and '{login}')
fr: Lorsque les membres des groupes sont stockés dans un attribut du groupe, ce modèle de requête est utilisé pour extraire la liste des groupes d'un mandataire ; vous pouvez indiquer le DN et l'UID de l'utilisateur dans ce modèle, sous la forme '{dn}' et '{login}'

source: Group members attribute
fr: Attribut des membres

source: When groups members are stored inside a group attribute, this is the attribute name
fr: Lorsque les membres des groupes sont stockés dans un attribut du groupe, indiquez ici le nom de cet attribut

source: User groups attribute
fr: Attribut des groupes

source: When user groups are stored inside a user attribute, this is the attribute name
fr: Lorsque la liste de ses groupes est stockée dans un attribut du membre, indiquez ici le nom de cet attribut

source: Group mail mode
fr: Messagerie de groupe

source: Define how an email can be sent to group members
fr: Indique la façon dont les messages doivent être envoyés aux membre d'un groupe

source: DN replace expression
fr: Expression de remplacement

source: In 'redirect' mail mode, specify source and target DN parts, separated by a pipe
fr: En mode 'redirection', vous pouvez indiquer les parties des DN source et cible, séparées par un pipe (|), pour réécrire le DN de la liste d'origine

source: In 'internal' mail mode, specify name of group mail attribute
fr: En mode 'interne', spécifie le nom de l'attribut du groupe contenant son adresse de messagerie

source: Comma separated list of additional attributes which will be extracted by groups principals
fr: Vous pouvez indiquer, en les séparant par des virgules, une liste d'attributs spécifiques qui seront extraits pour compléter les informations sur les groupes lors de leur recherche

source: Users select query
fr: Sélection des utilisateurs

source: Query template used to select users
fr: Modèle de requête LDAP utilisée pour effectuer la recherche de mandataires

source: Users search query
fr: Recherche des utilisateurs

source: Query template used to search users
fr: Modèle de requête LDAP utilisée pour effectuer la recherche des utilisateurs dans le moteur de recherche de l'annuaire LDAP

source: Groups select query
fr: Sélection des groupes

source: Query template used to select groups
fr: Modèle de requête LDAP utilisée pour effectuer la recherche des groupes de mandataires

source: Groups search query
fr: Recherche des groupes

source: Query template used to search groups
fr: Modèle de requête LDAP utilisée pour effectuer la recherche des groupes dans le moteur de recherche de l'annuaire LDAP

source: Add LDAP directory...
fr: Ajouter un annuaire LDAP...

source: Connection
fr: Connexion

source: Users schema
fr: Schéma des utilisateurs

source: Groups schema
fr: Schéma des groupes

source: Search settings
fr: Critères de recherche

source: LDAP directory search form
fr: Moteur de recherche LDAP

source: Common name
fr: Nom courant

source: Mail address
fr: Adresse de messagerie

source: Search results
fr: Résultats de la recherche

source: unknown
fr: inconnu

source: LDAP entry attributes
fr: Attributs de l'entrée LDAP

source: Attribute
fr: Attribut

source: Value
fr: Valeur
