Repository: pypi-data/pypi-mirror-246
Catalog: packages/mwlib/mwlib-0.17.0.post1.zip/mwlib-0.17.0.post1/src/mwlib/writers/rl/locale/sco/LC_MESSAGES/mwlib.rl.po
Languages: sco

source: Index
sco: Indeix

source: Source:
sco: The Soorce

source: Contributors:
sco: Contreebuters:

source: Article Licenses
sco: Airticle Licenses

source: Editor:
sco: Eiditer:

source: Created on:
sco: Cræftit oan:

source: Articles
sco: Airticles

source: Produced by:
sco: Cræftit bi:

source: Table of Contents
sco: Buird o Contents

source: Skipping Articles!
sco: Skipping Airticles!

source: Please note: This is only a preview intended to give an idea how the book is typeset.
sco: Please mynd: This is yinlie ae luik ower intendit tae gie ye aen idea hou the buik is typeset.

source: Please note: This is only a preview of your book, intended to give an idea how your book looks. Only the first few articles, as well as the first pages of the index, of your book are shown in this preview. All articles, even those left out of the preview, will be included in the final printed book.
sco: Please mynd: This is yinlie ae luik ower o yer buik, intendit tae gie aen idea hou yer buik luiks. Yinlie the first few airticles, aes weel aes the first pages o the index, o yer buik ar shawn in this luikower. Aw airticles, even thae left oot o the luikower, will be incluidit in the final prentit buik.

source: References
sco: Reeferences

source: The following sections list the sources for all articles and images used in this book. Those sources provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
sco: The follaein sections leet the soorces fer aw airticles n eemages uised in this buik. Thae soorces provide mair detailed licensin information incluidin the copiericht status, the copiericht ainer, n the license condeetions.

source: The sources listed for each article provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
sco: The soorces leeted fer ilka airticle provide mair detailed licensin information incluidin the copiericht status, the copiericht ainer, n the license condeetions.

source: The sources listed for each image provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
sco: The soorces leeted fer ilka eemage provide mair detailed licensin information incluidin the copiericht status, the copiericht ainer, n the license condeetions.

source: Article Sources and Contributors
sco: Airticle Soorces n Contreebuters

source: Image Sources, Licenses and Contributors
sco: Eemage Soorces, Licenses n Contreebuters

source: Image
sco: Eemage

source: See also
sco: See forby

source: PDF generated using the open source mwlib toolkit. See http://code.pediapress.com/ for more information.
sco: PDF generated uisin the apen soorce mwlib tuilkist. See http://code.pediapress.com/ fer mair information.

source: Source
sco: Soorce

source: Contributors
sco: Contreebuters:

source: unknown
sco: onken't
