Repository: pypi-data/pypi-mirror-246
Catalog: packages/mwlib/mwlib-0.17.0.post1.zip/mwlib-0.17.0.post1/src/mwlib/writers/rl/locale/nap/LC_MESSAGES/mwlib.rl.po
Languages: nap

source: Index
nap: Énnece

source: Source:
nap: Funte:

source: License:
nap: Licenza:

source: Contributors:
nap: Autore:

source: Article Licenses
nap: Licenze dda vvoce

source: Title
nap: Titulo

source: Subtitle:
nap: Sottotitulo:

source: Editor:
nap: Curatore:

source: Created on:
nap: Criato 'o:

source: Contents
nap: Énnece

source: Articles
nap: Vvoce

source: Produced by:
nap: Prodotto 'a:

source: pdf writer version:
nap: vversione pdf writer:

source: mwlib version:
nap: vversione mwlib.ext:

source: Table of Contents
nap: Tabbella 'e Contenute

source: Skipping Articles!
nap: Vvoce nun cunvertite.

source: Please note: This is only a preview intended to give an idea how the book is typeset.
nap: Nota: Chest'è sulo n'anteprimma pe' se ffà n'idea 'e comme véne scritto 'o libbro.

source: Please note: This is only a preview of your book, intended to give an idea how your book looks. Only the first few articles, as well as the first pages of the index, of your book are shown in this preview. All articles, even those left out of the preview, will be included in the final printed book.
nap: Nota: Chest'è sulo n'anteprimma d' 'o libbro, destinato a dà n'idea 'e comme cumpare 'o libbro tuo. Sulamente 'e primm'articule, comme pure 'e primme paggene a l'innece, d' 'o libbro tuo so' mmustate dint'a st'anteprimma. Tutte l'articule, pure chille lassate fore 'e l'anteprimma, sarranno cummigliate dint' 'o libbro finale stampato.

source: References
nap: Note

source: Appendix
nap: Appendice

source: The following sections list the sources for all articles and images used in this book. Those sources provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
nap: 'E sezziune ccà abbascio alencano 'e ffonte relative a l'articule e fiùre ausate int'a stu libbro. Sti ffonte cunteneno nfurmaziune cchiù ndettaglie ncopp'a licienza d'uso, iógneno pure 'o stato d' 'e deritte d'autore, 'e titolare 'e chiste e cundiziune 'e licienza.

source: The sources listed for each article provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
nap: 'E ffonte nnecate p'ogne articolo ce danno nfurmaziune cchiù ndettaglio ncopp' 'a licienza, ca iógneno pure 'o stato d' 'o copyright, 'o proprietario d' 'e deritte d'autore e cundiziune 'e licienza.

source: The sources listed for each image provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
nap: 'E ffonte nnecate p'ogne fiúra ce danno nfurmaziune cchiù ndettaglio ncopp' 'a licienza, ca iógneno pure 'o stato d' 'o copyright, 'o proprietario d' 'e deritte d'autore e cundiziune 'e licienza.

source: Article Sources and Contributors
nap: Ffonte e Autore d' 'e paggene

source: Image Sources, Licenses and Contributors
nap: Ffonte, Licienze e Autore d' 'e fiùre

source: Image
nap: Fiùra

source: anonymous edits
nap: Cagnamiente anonime

source: Figure
nap: Fiùre

source: See also
nap: Vere anche

source: PDF generated using the open source mwlib toolkit. See http://code.pediapress.com/ for more information.
nap: PDF criàto pe' bbia d' 'o toolkit opensource ''mwlib''. Pe n'avé cchiú nfurmaziune, vire [[http://code.pediapress.com/ http://code.pediapress.com/]].

source: mwlib.ext version: %(version)s
nap: verziona mwlib.ext: %(version)s

source: mwlib version: %(mwlibversion)s, mwlib.rl version: %(mwlibrlversion)s, %(mwlibextversion)s
nap: verziona mwlib: %(mwlibversion)s, verziona mwlib.rl: %(mwlibrlversion)s, %(mwlibextversion)s

source: Source
nap: Funte

source: Contributors
nap: Autore:

source: unknown
nap: scanusciuto

source: License
nap: Licenza
