"""
Одним из наиболее используемых компонентов в графических программах является кнопка. В tkinter кнопки представлены классом Button. Основные параметры виджета Button:

command: функция, которая вызывается при нажатии на кнопку

compund: устанавливает расположение картинки и текста относительно друг друга

cursor: курсор указателя мыши при наведении на метку

image: ссылка на изображение, которое отображается на метке

pading: отступы от границ вилжета до его текста

state: состояние кнопки

text: устанавливает текст метки

textvariable: устанавливает привязку к элементу StringVar

underline: указывает на номер символа в тексте кнопки, который подчеркивается. По умолчанию значение -1, то есть никакой символ не подчеркивается

width: ширина виджета

Добавим в окно обычную кнопку из пакета ttk:
"""