"""
Метод grid() позволяет поместить виджет в определенную ячейку условной сетки или грида.

Метод grid применяет следующие параметры:

column: номер столбца, отсчет начинается с нуля

row: номер строки, отсчет начинается с нуля

columnspan: сколько столбцов должен занимать элемент

rowspan: сколько строк должен занимать элемент

ipadx и ipady: отступы по горизонтали и вертикали соответственно от границ элемента до его содержимого

padx и pady: отступы по горизонтали и вертикали соответственно от границ ячейки грида до границ элемента

sticky: выравнивание элемента в ячейке, если ячейка больше элемента. Может принимать значения n, e, s, w, ne, nw, se, sw, которые указывают соответствующее направление выравнивания
"""