"""
Виджет Radiobutton представляет переключатель, который может находиться в двух состояниях: отмеченном или неотмеченном. Но в отличие от Checkbutton переключатели могут создавать группу, из которой одномоментно мы можем выбрать только один переключатель.

Среди параметров конструктора Radiobutton стоит выделить следующие:

command: ссылка на функцию, которая вызывается при нажатии на переключатель

cursor: курсор при наведении на виджет

image: графическое изображение, отображаемое виджетом

padding: отступы от содержимого до границы переключателя

state: состояние виджета, может принимать значения NORMAL (по умолчанию), DISABLED и ACTIVE

text: текст виджета

textvariable: устанавливает привязку к переменной StringVar, которая задает текст переключателя

underline: индекс подчеркнутого символа в тексте виджета

variable: ссылка на переменную, как правило, типа IntVar, которая хранит состояние переключателя

value: значение переключателя

width: ширина виджета
"""