"""
Checkbutton
Последнее обновление: 12.09.2022

Элемент Checkbutton представляет собой флажок, который может находиться в двух состояниях: отмеченном и неотмеченном.

Конструктор Checkbutton принимает ряд параметров, отметим основные из них:

command: ссылка на функцию, которая вызывается при нажатии на флажок

cursor: курсор при наведении на элемент

image: графическое изображение, отображаемое на элементе

offvalue: значение флажка в неотмеченном состоянии, по умолчанию равно 0

onvalue: значение флажка в отмеченном состоянии, по умолчанию равно 1

padding: отступы от текста до границы флажка

state: состояние элемента, может принимать значения NORMAL (по умолчанию), DISABLED и ACTIVE

text: текст элемента

textvariable: привязанный к тексту объект StringVar

underline: индекс подчеркнутого символа в тексте флажка

variable: ссылка на переменную, как правило, типа IntVar, которая хранит состояние флажка

width: ширина элемента
"""