"""
Поле ввода Entry
Последнее обновление: 23.09.2022

Элемент Entry представляет поле для ввода текста. С помощью конструктора Entry можно установить ряд параметров, основные из них:

background: фоновый цвет

cursor: курсор указателя мыши при наведении на текстовое поле

foreground: цвет текста

font: шрифт текста

justify: устанавливает выравнивание текста. Значение LEFT выравнивает текст по левому краю, CENTER - по центру, RIGHT - по правому краю

show: задает маску для вводимых символов

state: состояние элемента, может принимать значения NORMAL (по умолчанию) и DISABLED

textvariable: устанавливает привязку к элементу StringVar

width: ширина элемента

Элемент Entry имеет ряд методов. Основные из них:

insert(index, str): вставляет в текстовое поле строку по определенному индексу

get(): возвращает введенный в текстовое поле текст

delete(first, last=None): удаляет символ по индексу first. Если указан параметр last, то удаление производится до индекса last. Чтобы удалить до конца, в качестве второго параметра можно использовать значение END.

focus(): установить фокус на текстовое поле
"""