"""
Виджет Label представляет текстовую метку. Этот элемент позволяет выводить статический текст без возможности редактирования.

Для создания элемента Label применяется конструктор, который принимает два параметра:

1
Label(master, options)
Параметр master представляет ссылку на родительский контейнер, а параметр options представляет следующие именованные параметры

anchor: устанавливает позиционирование текста

background: фоновый цвет

borderwidth: толщина границы метки

cursor: курсор указателя мыши при наведении на метку

font: шрифт текста

foreground: цвет текста

height: высота виджета

image: ссылка на изображение, которое отображается на метке

justify: устанавливает выравнивание текста. Значение LEFT выравнивает текст по левому краю, CENTER - по центру, RIGHT - по правому краю

pading: отступы от границ вилжета до его текста

relief: определяет тип границы, по умолчанию значение FLAT

text: устанавливает текст метки

textvariable: устанавливает привязку к элементу StringVar

underline: указывает на номер символа в тексте метки, который подчеркивается. По умолчанию значение -1, то есть никакой символ не подчеркивается

width: ширина виджета

wraplength: при положительном значении строки текста будут переносится для вмещения в пространство виджета

"""