"""
Виджет Listbox в tkinter представляет список объектов. Стоит отметить, что данный виджет присутствует только в пакете tkinter, а в пакете tkinter.ttk для него нет аналогов.

Для настройки Listbox мы можем указать в его конструкторе следующие параметры:

listvariable: список элементов, которые добавляются в ListBox

bg: фоновый цвет

bd: толщина границы вокруг элемента

cursor: курсор при наведении на Listbox

font: настройки шрифта

fg: цвет текста

highlightcolor: цвет элемента, когда он получает фокус

highlightthickness: толщина границы элемента, когда он находится в фокусе

relief: устанавливает стиль элемента, по умолчанию имеет значение SUNKEN

selectbackground: фоновый цвет для выделенного элемента

selectmode: определяет, сколько элементов могут быть выделены. Может принимать следующие значения: BROWSE, SINGLE, MULTIPLE, EXTENDED. Например, если необходимо включить множественное выделение элементов, то можно использовать значения MULTIPLE или EXTENDED.

height: высота элемента в строках. По умолчанию отображает 10 строк

width: устанавливает ширину элемента в символах. По умолчанию ширина - 20 символов

xscrollcommand: задает горизонтальную прокрутку

yscrollcommand: устанавливает вертикальную прокрутку
"""