"""
Text предназначен для отображения и редактирования многострочного текста. Стоит отметить, что данный виджет доступен только в основном пакете tkinter, в пакете tkinter.ttk аналога нет.

Основные параметры конструктора Text:

bd / borderwidth: толщина границы

bg/background: фоновый цвет

fg/foreground: цвет текста

font: шрифт текста, например, font="Arial 14" - шрифт Arial высотой 14px, или font=("Verdana", 13, "bold") - шрифт Verdana высотой 13px с выделением жирным

height: высота в строках

padx: отступ от границ кнопки до ее текста справа и слева

pady: отступ от границ кнопки до ее текста сверху и снизу

relief: определяет тип границы, может принимать значения SUNKEN, RAISED, GROOVE, RIDGE

state: устанавливает состояние кнопки, может принимать значения DISABLED, ACTIVE, NORMAL (по умолчанию)

width: ширина в символах

wrap: указывает, каким образом переносить текст, если он не вмещается в границы виджета
Перенос текста
Иногда предложения в текстовом поле могут быть очень большими, что могут не помещаться в отведенное для них пространство виджета. В этом случае большое значение имеет стратегия переноса, которая устанавливается с помощью параметра wrap. Этот параметр может принимать следующие параметры:

none: переносы отстуствуют, но можно сделать горизонтальную прокрутку

char: переносы осуществляются по символам

word: переносы осуществляются по словам
"""