Repository: pypi-data/pypi-mirror-246
Catalog: packages/mwlib/mwlib-0.17.0.post1.zip/mwlib-0.17.0.post1/src/mwlib/writers/rl/locale/av/LC_MESSAGES/mwlib.rl.po
Languages: av

source: Index
av: Индекс

source: Source:
av: Ицц:

source: License:
av: Лицензия:

source: Contributors:
av: Аслиял авторал:

source: Article Licenses
av: Макъалабазул лицензиял

source: Title
av: БетIер

source: Subtitle:
av: ГъоркьбетӀер:

source: Editor:
av: Редактор:

source: Created on:
av: Гьабуна гьаниб:

source: Contents
av: Жаниб бугеб жо

source: Articles
av: Макъалаби

source: Produced by:
av: Гьабуна:

source: pdf writer version:
av: pdf генераторалъул версия:

source: mwlib version:
av: mwlib.ext-алъул версия:

source: Table of Contents
av: Жаниб бугеб жо

source: Skipping Articles!
av: Гъркьо риччан тарал макъалаби!

source: Please note: This is only a preview intended to give an idea how the book is typeset.
av: ХӀисаб гьабе: Мун букӀизесеб техьалъул куцалъухъ валагьун вуго.

source: Please note: This is only a preview of your book, intended to give an idea how your book looks. Only the first few articles, as well as the first pages of the index, of your book are shown in this preview. All articles, even those left out of the preview, will be included in the final printed book.
av: ХӀисаб гьабе: Мун букӀизесеб техьалъул куцалъухъ валагьун вуго. Гьаб балагьиялда бихьизабун буго техьалъул чамалиго тӀоцебесеб макъала. Гьани бихьизабичӀебщинаб жо ахир-къадги тӀехьалда букӀине буго.

source: References
av: Рекъезаби

source: Appendix
av: Программа

source: The following sections list the sources for all articles and images used in this book. Those sources provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
av: Хадусел бутӀабазда руго рихьизарун макъалаби росарал бакӀалги ва гьединго суртал росараб бакӀалги. Источниказда хъван буго авторасул хӀукъукъазул, лицензиязул ва гьел щущазариялъул къотӀабазул хӀакъалъулъ информация.

source: The sources listed for each article provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
av: Жегиги мухӀканаб авторазул хӀукъукъазул хважаинзабазда ва гьезул статусазда хурхараб информация бихьизабун буго жиб-жиб макъалаялъул источниказда.

source: The sources listed for each image provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
av: Жегиги мухӀканаб авторазул хӀукъукъазул хважаинзабазда ва гьезул статусазда, лицензиязда хурхараб информация бихьизабун буго жиб-жиб сураталъул иццазда.

source: Article Sources and Contributors
av: Иццал ва аслиял авторал

source: Image Sources, Licenses and Contributors
av: Иццал, лицензиял ва суртазул редакторал

source: Image
av: Сурат

source: anonymous edits
av: анонимнияб хиса-баси

source: Figure
av: Квералъ бахъараб сурат

source: See also
av: Гь. балагье

source: PDF generated using the open source mwlib toolkit. See http://code.pediapress.com/ for more information.
av: PDF гьабуна рагьараб mwlib кодгун бугеб алатги хӀалтӀизабун. Балагье http://code.pediapress.com/ жеги информация лъазабизе бокьани.

source: mwlib.ext version: %(version)s
av: mwlib.ext версия: %(version)s

source: mwlib version: %(mwlibversion)s, mwlib.rl version: %(mwlibrlversion)s, %(mwlibextversion)s
av: mwlib версия: %(mwlibversion)s, mwlib.rl version: %(mwlibrlversion)s, %(mwlibextversion)s

source: Source
av: Ицц

source: Contributors
av: Редакторал

source: unknown
av: лъаларо

source: License
av: Лицензия
