Repository: pypi-data/pypi-mirror-246
Catalog: packages/pyams-fields/pyams_fields-2.0.1.tar.gz/pyams_fields-2.0.1/src/pyams_fields/locales/*/LC_MESSAGES/pyams_fields.po
Languages: fr

source: Text
fr: Texte simple

source: Multi-lines text
fr: Texte multi-lignes

source: Boolean
fr: Booléen

source: Integer
fr: Nombre entier

source: Decimal
fr: Nombre avec décimales

source: Time
fr: Heure

source: Datetime
fr: Date et heure

source: Dates range
fr: Intervalle de dates

source: first date
fr: du

source: last date
fr: au

source: Datetime range
fr: Intervalle de dates et heures

source: Phone number
fr: Numéro de téléphone

source: E-mail address
fr: Adresse de messagerie

source: Choice
fr: Sélection simple dans une liste

source: List
fr: Sélections multiple dans une liste

source: Timezone
fr: Fuseau horaire

source: Field name
fr: Nom du champ

source: Field internal name; must be unique for a given form
fr: Nom interne du champ ; il doit être unique au sein du formulaire

source: Field type
fr: Type de champ

source: Selected field type
fr: Le type de champ détermine les informations qui peuvent être saisies par l'utilisateur

source: Label
fr: Libellé

source: User field label
fr: Libellé du champ tel qu'affiché à l'utilisateur

source: Field description can be displayed as hint
fr: La description du champ pourra être affichée sous différentes formes en fonction du thème graphique

source: Placeholder
fr: Texte d'attente

source: Some field types like text line can display a placeholder
fr: Certains types de champs peuvent prendre en charge un texte d'attente, qui s'affiche tant qu'aucune information n'a été saisie

source: Optional values
fr: Liste des valeurs

source: List of available values (for 'choice' and 'list' field types)
fr: Liste des valeurs disponibles pour les champs de sélection simple ou multiple

source: Default value
fr: Valeur par défaut

source: Give default value if field type can use it
fr: Définit la valeur par défaut du champ, pour ceux qui le supportent

source: Required?
fr: Champ obligatoire

source: Select 'yes' to set field as mandatory
fr: Sélectionnez cette option pour que la saisie du champ soit obligatoire

source: Select 'no' to hide given field...
fr: Sélectionnez 'non' pour masquer ce champ sans le supprimer

source: Use captcha
fr: Utiliser un captcha

source: Use captcha to check form submission
fr: Utiliser un captcha pour valider la soumission du formulaire

source: Default client key
fr: Clé cliente par défaut

source: This key is included into HTML code and submitted with form data
fr: Cette clé est intégrée dans le code HTML et soumise avec les données du formulaire

source: Default server key
fr: Clé serveur par défaut

source: This key is used on server side to communicate with Google reCaptcha services
fr: Cette clé est utilisée par le serveur pour communiquer avec les services reCaptcha de Google

source: Use proxy server?
fr: Utiliser un serveur proxy

source: If a proxy server is required to access recaptcha services, please set them here
fr: À sélectionner lorsque l'utilisation d'un serveur proxy est nécessaire

source: Protocol
fr: Protocole

source: If your server is behind a proxy, please set it's protocol here; HTTPS support is required for reCaptcha
fr: Si votre service est protégé par un serveur proxy, vous devez indiquer le protocole ici ; le support du protocole HTTPS est requis pour accéder au service reCaptcha

source: Host name
fr: Nom d'hôte

source: If your server is behind a proxy, please set it's address here; captcha verification requires HTTPS support
fr: Adresse IP ou nom DNS du serveur proxy

source: Port number
fr: Numéro de port

source: If your server is behind a proxy, please set it's port number here
fr: Numéro de port du serveur proxy

source: Username
fr: Code utilisateur

source: If your proxy server requires authentication, please set username here
fr: Si le serveur proxy nécessite une authentification, indiquer ici le code utilisateur

source: Password
fr: Mot de passe

source: If your proxy server requires authentication, please set password here
fr: Si le serveur proxy nécessite une authentification, indiquer ici le mot de passe

source: Use proxy only from
fr: Domaines sélectionnés

source: If proxy usage is restricted to several domains names, you can set them here, separated by comas
fr: Si l'utilisation du proxy est limitée à certains noms de domaines, vous pouvez indiquer leurs noms ici, séparés par une virgule

source: Override default captcha settings
fr: Remplacer le captcha par défaut

source: Select this option to define custom captcha keys for this form
fr: Sélectionner cette option pour définir des clés de captcha spécifiques

source: Client key
fr: Clé cliente

source: This key (also called 'site key') is included into HTML code and submitted with form data
fr: Cette clé (également appelée 'clé de site') est intégrée au code HTML et soumise avec les données du formulaire

source: Server key
fr: Clé serveur

source: This key (also called 'secret key') is used on server side to communicate with Google reCaptcha services
fr: Cette clé (également appelée 'clé secrète') est utilisée par le serveur pour communiquer avec le service reCaptcha de Google

source: Required RGPD consent
fr: Demander le consentement RGPD

source: If 'yes', an RGPD compliance warning will be displayed above form's submit button; form can't be submitted as long as the associated checkbox will not be checked explicitly by the user
fr: Si 'oui', un message d'avertissement sur la conformité au RGPD sera affiché à l'utilisateur au-dessus du bouton de soumission; le formulaire ne peut pas être soumis tant que la case à cocher correspondante n'aura pas été sélectionnée

source: RGPD consent text
fr: Texte de consentement

source: User consent must be explicit, and user must be warned about usage which will be made of submitted data; text samples are given below
fr: Le consentement de l'utilisateur doit être explicite, et il doit être informé de l'usage qui pourrait être fait des données soumises ; un exemple de texte est indiqué ci-dessous

source: RGPD user rights
fr: Droits de révocation

source: The internet user must be able to easily revoke his consent later on, so it is important to inform him how to proceed; below are examples of possible formulations
fr: L'utilisateur doit pouvoir annuler son consentement à tout moment ; il est donc important de lui expliquer comment procéder, un exemple de texte est indiqué ci-dessous

source: Authenticated only?
fr: Utilisateurs authentifiés uniquement

source: If 'yes', only authenticated users will be able to see and submit form
fr: Si 'oui', seuls des utilisateurs authentifiés auront accès au formulaire

source: Submit button label
fr: Libellé du bouton

source: Label of form submit button
fr: Libellé du bouton de soumission du formulaire

source: Submit message
fr: Message de soumission

source: This message will be displayed after form submission; you can include the submission ID using the {_reference} syntax
fr: Le contenu de ce message sera affiché après la soumission du formulaire et sa bonne prise en charge ; vous pouvez y intégrer la référence de la soumission en utilisant la syntaxe {_reference}

source: Submission ID format
fr: Identifiant des soumissions

source: Submission ID is based on the current date and time, formatted using this formatting string
fr: L'identifiant de chaque soumission est basé sur la date et l'heure courante au moment de la soumission, que vous pouvez formatter en utilisant cette chaîne de caractères

source: Selected handlers
fr: Modules de prise en charge

source: The selected form handlers defines how user submitted data will be managed
fr: Vous pouvez sélectionner plusieurs modules de prise en charge du formulaire ; les données saisies leur seront transmises dans l'ordre de sélection

source: Form handlers
fr: Traitement des données du formulaire

source: No selected handler
fr: Aucun module de prise en charge sélectionné

source: Form fields
fr: Champs de saisie

source: Public label
fr: Libellé

source: Form fields list
fr: Liste des champs de saisie

source: You must define RGPD consent text and user rights to enable RGPD consent!
fr: Vous devez définir le texte de consentement de l'utilisateur ainsi que ses droits de retrait pour activer le support au RGPD !

source: Add form field
fr: Ajouter un champ de saisie

source: New form field
fr: Nouveau champ de saisie

source: New form field properties
fr: Propriétés du nouveau champ

source: Another form field already exists with this name!
fr: Il existe déjà un autre champ de ce formulaire portant ce nom !

source: Form field: {}
fr: Champ de saisie : {}

source: Form field properties
fr: Propriétés du champ

source: Clone field
fr: Dupliquer le champ

source: You must define client and server keys to use a captcha
fr: Vous devez définir la clé cliente et la clé serveur pour activer un captcha

source: You must define protocol, host name and port be able to use a proxy!
fr: Vous devez définir le protocole, le nom d'hôte et le numéro de port pour utiliser un proxy !

source: You must redefine both client and server keys, or none or them to disable captcha for this form!
fr: Vous devez redéfinir les clés cliente et serveur, au aucune des deux si vous souhaitez désactiver le captcha pour ce formulaire !

source: Text sample:
fr: Exemple de texte :

source: - By submitting this form, I agree that the entered information may be used for the purpose of my request and the business relationship that may result from it.
fr: - En soumettant ce formulaire, j'accepte que les informations saisies soient utilisées dans le cadre du traitement de ma demande, ainsi que dans le cadre de la relation commerciale qui peut en résulter.

source: - To know and enforce your rights, including the right to withdraw your consent to the use of the data collected by this form, please consult our privacy policy.
fr: - Pour connaître et faire appliquer vos droits, notamment votre droit de retrait au consentement à l'utilisation des données que vous nous aurez fournies à travers ce formulaire, veuillez consulter notre politique de confidentialité.

source: yes
fr: oui

source: no
fr: non

source: from %d/%m/%Y
fr: à partir du %d/%m/%Y

source: to %d/%m/%Y
fr: jusqu'au %d/%m/%Y

source: from %d/%m/%Y at %H:%M
fr: à partir du %d/%m/%Y à %H:%M

source: to %d/%m/%Y at %H:%M
fr: jusqu'au %d/%m/%Y à %H:%M

source: Can't submit form.
fr: Une erreur s'est produite.

source: Missing recaptcha token!
fr: Données manquantes pour la vérification du captcha !

source: Can't verify recaptcha token! Are you a robot?
fr: Impossible de vérifier le captcha. Seriez-vous un robot ?

source: You can't submit this form without accepting data usage rules.
fr: Vous ne pouvez pas soumettre les données de ce formulaire sans accepter les conditions d'utilisation

source: CSRF token
fr: Jeton CSRF
