Repository: pypi-data/pypi-mirror-246
Catalog: packages/mwlib/mwlib-0.17.0.zip/mwlib-0.17.0/src/mwlib/writers/rl/locale/*/LC_MESSAGES/mwlib.rl.po
Languages: kk_cyrl

source: Index
kk_cyrl: Индекс

source: Source:
kk_cyrl: Қайнар көзі:

source: License:
kk_cyrl: Лицензиясы:

source: Contributors:
kk_cyrl: Қатысушылар:

source: Article Licenses
kk_cyrl: Мақала лицензиялары

source: Title
kk_cyrl: Атауы

source: Subtitle:
kk_cyrl: Тақырыпша:

source: Editor:
kk_cyrl: Редактор

source: Created on:
kk_cyrl: Құрылғаны:

source: Contents
kk_cyrl: Мазмұны

source: Articles
kk_cyrl: Мақалалар

source: Produced by:
kk_cyrl: Жасаған:

source: pdf writer version:
kk_cyrl: pdf-ке жазу нұсқасы:

source: mwlib version:
kk_cyrl: mwlib нұсқасы:

source: Table of Contents
kk_cyrl: Мазмұны

source: Skipping Articles!
kk_cyrl: Өткізілген мақалалар!

source: Please note: This is only a preview intended to give an idea how the book is typeset.
kk_cyrl: Назар аударыңыз: Бұл тек алдын ала көрініс, яғни кітап қалай болатыны туралы жалпы көрініс.

source: Please note: This is only a preview of your book, intended to give an idea how your book looks. Only the first few articles, as well as the first pages of the index, of your book are shown in this preview. All articles, even those left out of the preview, will be included in the final printed book.
kk_cyrl: Назар аударыңыз: Бұл тек алдын ала көрініс, яғни кітап қалай болатыны туралы жалпы көрініс. Бұл алдын ала көріністе тек мазмұнның алғашқы бірнеше мақалалары мен беттері көрсетілген. Барлық мақалалар, соның ішінде бұл алдын ала көріністе жоғы да, кітаптың соңғы шығарылған нұсқасына кіретін болады.

source: References
kk_cyrl: Бапталымдар

source: Appendix
kk_cyrl: Қолданба

source: The following sections list the sources for all articles and images used in this book. Those sources provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
kk_cyrl: Келесі бөлімдерде осы кітапта қолданылған барлық мақалалар мен суреттердің қайнарлары көрсетілген. Қайнарларда авторлық құқықтар, лицензия және жариялау шарттары бойынша толық ақпарат берілген.

source: The sources listed for each article provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
kk_cyrl: Авторлық құқықтың иесі мен күйі, сонымен қатар лицензия шарттары туралы толық ақпарат әр мақалаға сілтенген қайнарларда көрсетілген.

source: The sources listed for each image provide more detailed licensing information including the copyright status, the copyright owner, and the license conditions.
kk_cyrl: Авторлық құқықтың иесі мен күйі, сонымен қатар лицензия шарттары туралы толық ақпарат әр суретке сілтенген қайнарларда көрсетілген.

source: Article Sources and Contributors
kk_cyrl: Қайнар көздер және негізгі авторлар

source: Image Sources, Licenses and Contributors
kk_cyrl: Суреттің қайнары, лицензиясы және өңдеушілері

source: Image
kk_cyrl: Сурет

source: anonymous edits
kk_cyrl: анонимдық өзгертулер

source: Figure
kk_cyrl: Сурет

source: See also
kk_cyrl: Тағы қараңыз

source: PDF generated using the open source mwlib toolkit. See http://code.pediapress.com/ for more information.
kk_cyrl: PDF ашық кодты mwlib құралын қолдана отырып құрылды. Толық ақпарат үшін http://code.pediapress.com/ қараңыз.

source: mwlib.ext version: %(version)s
kk_cyrl: mwlib.ext нұсқасы: %(version)s

source: mwlib version: %(mwlibversion)s, mwlib.rl version: %(mwlibrlversion)s, %(mwlibextversion)s
kk_cyrl: mwlib нұсқасы: %(mwlibversion)s, mwlib.rl нұсқасы: %(mwlibrlversion)s, %(mwlibextversion)s

source: Source
kk_cyrl: Қайнар көзі

source: Contributors
kk_cyrl: Қатысушылар

source: unknown
kk_cyrl: Белгісіз

source: License
kk_cyrl: Лицензиясы
