Repository: pypi-data/pypi-mirror-246
Catalog: packages/notlar/notlar-0.11.tar.gz/notlar-0.11/notlar/translations/*/LC_MESSAGES/messages.po
Languages: gl

source: Contact us
gl: Póñase en contacto connosco

source: Please fill out the following form and we will get back to you shortly
gl: Por favor, complete o seguinte formulario e responderémoslle axiña

source: Any issue or idea?
gl: Algún problema ou idea?

source: Name
gl: Nome

source: Email
gl: Correo electrónico

source: Message
gl: Mensaxe

source: Phone
gl: Teléfono

source: Not available for now
gl: Non dispoñible por agora

source: Address
gl: Enderezo

source: Leave a comment for your note...
gl: Deixa un comentario para a túa nota...

source: Notes
gl: Notas

source: All notes
gl: Todas as notas

source: Please contact the administrator
gl: Contacta co administrador

source: Back to Homepage
gl: Volver á páxina principal

source: Contact
gl: Contacto

source: Calendar and notes
gl: Calendario e notas

source: Good way to schedule your life
gl: Bo xeito de programar a túa vida

source: Designed for creating notes
gl: Deseñado para crear notas

source: You are able to organize and schedule your work, studies, etc
gl: Podes organizar e programar o teu traballo, estudos, etc

source: Notes for improving your time
gl: Notas para mellorar o teu tempo

source: Create personalized notes to improve your time management skills and make the most out of every moment
gl: Crea notas personalizadas para mellorar as túas habilidades de xestión do tempo e aproveitar ao máximo cada momento

source: Take notes of your lessons
gl: Toma notas das túas leccións

source: Create important notes from your lessons, ensuring a comprehensive and organized record of valuable information
gl: Crea notas importantes das túas leccións, asegurando un rexistro completo e organizado de información valiosa

source: Have a better organization at work
gl: Ten unha mellor organización no traballo

source: Improve your work game time creating notes that facilitate better organization, helping you stay on top of tasks and deadlines
gl: Mellora o teu xogo no traballo creando notas que faciliten unha mellor organización, axudándote a manter o control de tarefas e prazos

source: Nice calendar design
gl: Bonito deseño de calendario

source: Unlock the potential of your schedule with the intuitive Notlar Calendar App
gl: Desbloquea o potencial da túa axenda coa intuitiva aplicación de calendario Notlar

source: Open sidebar
gl: Abrir barra lateral

source: Open user menu
gl: Abrir menú de usuario

source: Settings
gl: Axustes

source: Sign out
gl: Pechar sesión

source: Log In
gl: Iniciar sesión

source: Sign Up
gl: Rexistrarse

source: Login into Notlar
gl: Inicia sesión en Notlar

source: Close modal
gl: Pechar modal

source: Your email
gl: O teu correo electrónico

source: Your password
gl: A túa contrasinal

source: Remember me
gl: Lémbrame

source: Recover password
gl: Recuperar contrasinal

source: Login to your account
gl: Inicia sesión na túa conta

source: Register for using Notlar
gl: Rexístrate para usar Notlar

source: Last Name
gl: Apelidos

source: Your email (It will be your username)
gl: O teu correo electrónico (será o teu nome de usuario)

source: Lost Password?
gl: Olvidaste a contrasinal?

source: Do you already have an account?
gl: Xa tes unha conta?

source: Login
gl: Iniciar sesión

source: Something's missing
gl: Falta algo
